app/Controllers/Peixes.php

    public function listar()
    {
        $data = $this->peixesModel->findAll();
---
SELECT *
FROM `peixes`

    public function novoPeixe(){
        $this->peixesModel->save([
            'especie' => $this->request->getPost('especie'),
            'tipo' => $this->request->getPost('tipo'),
            'origem' => $this->request->getPost('origem'),
            'ph' => $this->request->getPost('ph'),
            'tamanho' => $this->request->getPost('tamanho'),
            'idade' => $this->request->getPost('idade'),
            'valor' => $this->request->getPost('valor')
        ]);
---
INSERT INTO `peixes` (`especie`, `tipo`, `origem`, `ph`, `tamanho`, `idade`, `valor`) VALUES ('polypterus', 'jumbo', 'europa', '6', '12', '5', '5')

    public function deletar($id){
        $this->peixesModel->delete($id);
---
DELETE FROM `peixes`
WHERE `id` IN ('6')

    public function atualizar($id){
        $data = $this->request->getJSON();
        $this->peixesModel->update($id, $data);
---
UPDATE `peixes` SET `tipo` = 'ciclideo'
WHERE `peixes`.`id` IN ('8')