app/Models/PeixesModel.php

    public function getPeixes($id){
        return $this->asArray()->where(['id'=>$id])->first();
---
SELECT *
FROM `peixes`
WHERE `id` = '2'
 LIMIT 1